read_verilog xorshift64.v
synth -top xorshift64 -flatten
opt
dfflibmap -liberty cmos_cells_default.lib
abc -liberty cmos_cells_default.lib
write_verilog -noattr -renameprefix DFed_ lv1_xorshift64.v
